## importing libraries

In [1]:
import pandas as pd
import numpy as np

In [4]:
df=pd.DataFrame(np.arange(0,20).reshape(4,5),index=['row 1','row 2','row 3','row 4'],
               columns=['a','b','c','d','e'])
df

        a   b   c   d   e
row 1   0   1   2   3   4
row 2   5   6   7   8   9
row 3  10  11  12  13  14
row 4  15  16  17  18  19

In [8]:
## accessing elements
df.loc['row 1']

a    0
b    1
c    2
d    3
e    4
Name: row 1, dtype: int32

In [10]:
## exporting dataframe
df.to_csv('pandas_1.csv')

In [11]:
type(df.to_csv('pandas_1.csv'))

NoneType

In [14]:
df.iloc[0:2,1:4]

       b  c  d
row 1  1  2  3
row 2  6  7  8

In [15]:
df

        a   b   c   d   e
row 1   0   1   2   3   4
row 2   5   6   7   8   9
row 3  10  11  12  13  14
row 4  15  16  17  18  19

In [17]:
## converting dataframe into array
df.iloc[:,:].values

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [18]:
## to check if have any null values
df.isnull().sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of            a      b      c      d      e
row 1  False  False  False  False  False
row 2  False  False  False  False  False
row 3  False  False  False  False  False
row 4  False  False  False  False  False>

In [21]:
## unique items
df['a'].value_counts()

0     1
5     1
10    1
15    1
Name: a, dtype: int64

In [24]:
## view multiple columns put it inside list
df[['a','b','c']]

        a   b   c
row 1   0   1   2
row 2   5   6   7
row 3  10  11  12
row 4  15  16  17

In [25]:
## to see top 5 items
df.head()

        a   b   c   d   e
row 1   0   1   2   3   4
row 2   5   6   7   8   9
row 3  10  11  12  13  14
row 4  15  16  17  18  19